import {ESPRESSO, ESPRESSO_LUNGO, RISTRETTO} from './drinks';

export class Technology {
    constructor(public image: string,
                public videoId: string | null,
                public title: string,
                public description: string) {
        this.image = image;
        this.videoId = videoId;
        this.title = title;
        this.description = description;
    }
}

export const crf = new Technology(
    'https://www.dropbox.com/scl/fi/pdbeirc2n4jcg0001oc0e/CRF.jpg?rlkey=l4onir9xwfy817p912r6rcf7n&dl=0&raw=1',
    null,
    'CRF',
    'CRF (Compact - Компактність, Reliable - Надійність, Fresh - Свіжість) — це комплекс взаємодії системи Tubeless та заварювального блоку. В основу системи закладено три принципи: легко виймається; не вимагає спеціальних знань для здійснення догляду; легко промивається водою. Це гарантує споживачу економію часу та коштів.',
);

export const tubeless = new Technology(
    'https://www.dropbox.com/scl/fi/v2dutt7j5cn7nxs5r43ux/Tubeless.jpg?rlkey=oyonu2z2xczh5e16f9jm9rlt8&dl=0&raw=1',
    'dTTbafGlvVw',
    'Tubeless',
    'Заварювальний блок кавомашин De’Longhi під’їжджає впритул до кавомолки в момент її роботи. Мелена кава подається напряму в заварювальний блок без трубок та воронок. Завдяки цьому мінімізується кількість кави, яка залишається в системі після кожного приготування. Тому споживач завжди п’є каву, яка була щойно змелена, іншими словами - бездоганно-свіжу каву.',
);

export const brewingUnit = new Technology(
    'https://www.dropbox.com/scl/fi/uisbe4nf5a8gb4z9wpe52/Brewing-Unit.jpg?rlkey=c56q1xvgfv3pwz3e9h2ciukr0&dl=0&raw=1',
    'tK5PLd2duUY',
    'Brewing Unit',
    'Заварювальний блок — це «серце» повністю автоматичної кавомашини, а отже, і процесу приготування кави. Заварювальний блок De’Longhi має змінну камеру, здатну вміщувати різну кількість меленої кави, щоб завжди забезпечувати ідеальний результат у чашці, незалежно від рівня аромату та вибраного напою. Він правильно формує дозу меленої кави, так що екстрагується ідеальна, щільна, ароматна кава.\n' +
    'Саморегулююча система темперування кави застосовує оптимальний тиск залежно від обраного напою та ступеня його міцності, а також обраного ступеня помелу.\n' +
    'Діапазон тиску пресування складає від 20 до 40 кг. Фаза перед заварюванням гарантує, що мелена кава буде рівномірно зволожена водою, щоб забезпечити оптимальне заварювання. На наступній стадії вода протікає через каву з певною швидкістю та з правильним тиском, щоб гарантувати ідеальний аромат, уникаючи недостатньої чи надмірної екстракції. Для помелу фракцією 500 мк кавомашини De’Longhi проводять екстракцію під тиском від 9 до 12 бар (із середнім показником у 11,7 бар), що є бездоганним показником для приготування ідеального еспресо.',
);

export const thermoblock = new Technology(
    'https://www.dropbox.com/scl/fi/w28thlcal0ct8u56bgfg6/Therrmoblock.jpg?rlkey=e338oqtqsnozsykwpgaja37gq&dl=0&raw=1',
    'Wd1kmTkFxsY',
    'Thermoblock Technology',
    'Система термоблока і вдосконалене електронне управління гарантують, що вода завжди нагрівається при оптимальній температурі. У поєднанні з тиском правильна температура води життєво необхідна для кави високої якості. Правильна температура для заварювання повинна бути між 88 °C та 96 °C. У будь-якій кавомашині De’Longhi є можливість встановити температуру в діапазоні від 88 до 96 градусів.',
);

export const twinShot = new Technology(
    'https://www.dropbox.com/scl/fi/3rxz239ldwkhqhsbkun0x/Twin-Shot.jpg?rlkey=gu917e0uga13aydp7b2xsjy0n&dl=0&raw=1',
    null,
    'Twin Shot',
    `Twin Shot — це запатентована система, яка дозволяє приготувати дві чашки кави за один цикл помелу і заварювання, зберігаючи чудову кремову пінку та ідеальну температуру напою. Споживач отримує бездоганну каву навіть при одночасному приготування двох чашок та економить свій час. Система Twin Shot працює з напоями: ${RISTRETTO}, ${ESPRESSO}, ${ESPRESSO_LUNGO}`,
);

export const latteCremaHot = new Technology(
    'https://www.dropbox.com/scl/fi/plmxh8dmecim7nfyweezf/LatteCrema-Hot.jpg?rlkey=v6hbqi0pvq82czwdyh76f0285&dl=0&raw=1',
    'RwQq7Tr2cBU',
    'LatteCrema Hot Technology',
    'De’Longhi вдосконалила технологію автоматичного спінювання молока одним дотиком завдяки спеціальній карафці LatteCrema. Пара, повітря та молоко змішуються в ідеальних пропорціях для створення ідеальної піни, яка подається безпосередньо з карафки в чашку. Споживач може вибрати між 3 текстурами піни як зі звичайним молоком, так і з рослинними альтернативами. Температура молока на виході складає 60-65 °C, що є ідеальним показником для приготування гарячого кавового молочного напою. Карафка LatteCrema оснащена автоматичною системою очищення: достатньо повернути ручку в положення CLEAN, і кавомашина зробить все інше, дозволяючи насолоджуватися напоєм, не відволікаючись. Карафка LatteCrema легко розбирається, а всі її частини можна мити в посудомийній машині для додаткового рівня гігієни.',
);

export const latteCremaCool = new Technology(
    'https://www.dropbox.com/scl/fi/uo2hmx0g2wk7442bbal3x/LatteCrema-Cool.webp?rlkey=oo3m4736r54eg0nzme8n19odj&dl=0&raw=1',
    'sgPlSe5SZiU',
    'LatteCrema Cool Technology',
    'LatteCrema Cool — нова система піноутворення молока, яка забезпечує бархатисту молочну піну при ідеальній температурі для холодних напоїв і включає в себе «формулу солодкості» від De’Longhi, щоб ідеально посилити солодкі нотки молока. Температура молока на виході складає 20 °C, що є ідеальним балансом між температурою і смаком. Для людського організму молоко сприймається холодним та солодким. Усі переваги LatteCrema Hot (можливість регулювати текстуру піни, легке очищення та ін.) характерні і для LatteCrema Cool Technology.',
);